In [7]:
import os
import pandas as pd

In [9]:
path = os.getcwd()
files = os.listdir('C:/Users/ayrat/OneDrive/Рабочий стол/Excel')
files

['1.xlsx', '2.xlsx']

In [13]:
files_xls = [f for f in files if f[-4:] == 'xlsx']
files_xls

['1.xlsx', '2.xlsx']

In [20]:
df = pd.DataFrame()

In [21]:
for f in files_xls:
    data = pd.read_excel(f, 'Лист1')
    data['имя файла'] = f
    df = df.append(data)

In [28]:
df

  Unnamed: 0 Unnamed: 1 Unnamed: 2 имя файла
0        NaN        NaN        NaN    1.xlsx
1          1          2          3    1.xlsx
2      арбуз      тыква   апельсин    1.xlsx
0        NaN        NaN        NaN    2.xlsx
1          1          2          3    2.xlsx
2   мандарин      слива       дыня    2.xlsx

In [29]:
df.reset_index()

   index Unnamed: 0 Unnamed: 1 Unnamed: 2 имя файла
0      0        NaN        NaN        NaN    1.xlsx
1      1          1          2          3    1.xlsx
2      2      арбуз      тыква   апельсин    1.xlsx
3      0        NaN        NaN        NaN    2.xlsx
4      1          1          2          3    2.xlsx
5      2   мандарин      слива       дыня    2.xlsx

In [30]:
df.reset_index(drop = True)

  Unnamed: 0 Unnamed: 1 Unnamed: 2 имя файла
0        NaN        NaN        NaN    1.xlsx
1          1          2          3    1.xlsx
2      арбуз      тыква   апельсин    1.xlsx
3        NaN        NaN        NaN    2.xlsx
4          1          2          3    2.xlsx
5   мандарин      слива       дыня    2.xlsx

In [31]:
%%timeit 
df.loc[df['Unnamed: 0'] == 1, 'text_rating'] = 'Pass'

503 µs ± 27.7 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [32]:
df

  Unnamed: 0 Unnamed: 1 Unnamed: 2 имя файла text_rating
0        NaN        NaN        NaN    1.xlsx         NaN
1          1          2          3    1.xlsx        Pass
2      арбуз      тыква   апельсин    1.xlsx         NaN
0        NaN        NaN        NaN    2.xlsx         NaN
1          1          2          3    2.xlsx        Pass
2   мандарин      слива       дыня    2.xlsx         NaN

In [ ]:
df = pd.DataFrame([('bird', 389.0),
                   ('bird', 24.0),
                   ('mammal', 80.5),
                   ('mammal', np.nan)],
                  index=['falcon', 'parrot', 'lion', 'monkey'],
                  columns=('class', 'max_speed'))

In [ ]:
.loc — используется для доступа по строковой метке — т.е. фактически по значению индекса и по названию столбца
.iloc — используется для доступа по числовому значению (начиная от 0) — т.е. по номеру строки и номеру столбца

In [36]:
df.loc[1,'Unnamed: 0']

1    1
1    1
Name: Unnamed: 0, dtype: object

In [38]:
df.iloc[1,2]

3

In [44]:
df.index.drop

In [45]:
df

  Unnamed: 0 Unnamed: 1 Unnamed: 2 имя файла text_rating
0        NaN        NaN        NaN    1.xlsx         NaN
1          1          2          3    1.xlsx        Pass
2      арбуз      тыква   апельсин    1.xlsx         NaN
0        NaN        NaN        NaN    2.xlsx         NaN
1          1          2          3    2.xlsx        Pass
2   мандарин      слива       дыня    2.xlsx         NaN

In [46]:
#скрыть индекс из фрейма данных
df.style.hide_index()

In [52]:
#экспорт в эксел без инжекса
df.to_excel("df.xlsx", sheet_name='Probability', startrow=3, startcol=0, index=False)